# ğŸ”¹ **Configuration du PAT (Port Address Translation) sur un routeur Cisco**  

## ğŸ“Œ **1. Introduction au PAT**  
Le **PAT (Port Address Translation)** est une forme de **NAT dynamique** qui permet Ã  plusieurs adresses IP privÃ©es d'utiliser une seule adresse IP publique en diffÃ©renciant les connexions Ã  l'aide des numÃ©ros de port.  

Le **PAT est couramment utilisÃ©** pour :  
âœ… Permettre Ã  plusieurs hÃ´tes internes dâ€™accÃ©der Ã  Internet avec une seule adresse IP publique.  
âœ… Ã‰conomiser les adresses IPv4 publiques.  
âœ… Offrir un niveau supplÃ©mentaire de sÃ©curitÃ© en masquant les adresses internes.  

---

## ğŸ“Œ **2. Exemple de topologie**  
- **RÃ©seau interne** : **192.168.1.0/24**  
- **Interface publique** : **GigabitEthernet0/1** avec l'IP publique **200.200.200.10**  

---

## ğŸ“Œ **3. Configuration du PAT avec une seule IP publique**  
### **ğŸ”¹ Ã‰tape 1 : Configurer une liste d'accÃ¨s (ACL) pour les adresses internes**
On commence par crÃ©er une **ACL** qui identifie les adresses IP privÃ©es autorisÃ©es Ã  utiliser le NAT.  
```bash
R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```
ğŸ“Œ **Explication** : Cette ACL permet Ã  tout hÃ´te de **192.168.1.0/24** d'utiliser le PAT.

---

### **ğŸ”¹ Ã‰tape 2 : Configurer le PAT avec une interface externe**
```bash
R1(config)# ip nat inside source list 1 interface GigabitEthernet0/1 overload
```
ğŸ“Œ **Explication** :  
- `source list 1` â†’ Utilise l'ACL 1 pour dÃ©finir les adresses privÃ©es Ã  traduire.  
- `interface GigabitEthernet0/1` â†’ Utilise l'adresse IP de cette interface comme adresse publique.  
- `overload` â†’ Permet Ã  plusieurs adresses privÃ©es de partager une seule IP publique en utilisant diffÃ©rents **numÃ©ros de port**.

---

### **ğŸ”¹ Ã‰tape 3 : DÃ©finir les interfaces NAT**
```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip nat inside
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip nat outside
R1(config-if)# exit
```
ğŸ“Œ **Explication** :  
- L'interface **GigabitEthernet0/0** est dÃ©finie comme interface **interne (inside)**.  
- L'interface **GigabitEthernet0/1** est dÃ©finie comme interface **externe (outside)**.

---

## ğŸ“Œ **4. Configuration du PAT avec un Pool d'IP Publiques**  
Si plusieurs adresses IP publiques sont disponibles, on peut utiliser un **pool d'adresses** plutÃ´t qu'une seule IP.

### **ğŸ”¹ Ã‰tape 1 : DÃ©finir un Pool d'IP Publiques**
```bash
R1(config)# ip nat pool PUBLIC_POOL 200.200.200.10 200.200.200.20 netmask 255.255.255.0
```
ğŸ“Œ **Explication** : CrÃ©e un **pool** d'adresses IP publiques de **200.200.200.10 Ã  200.200.200.20**.

### **ğŸ”¹ Ã‰tape 2 : Appliquer le NAT avec Overload**
```bash
R1(config)# ip nat inside source list 1 pool PUBLIC_POOL overload
```
ğŸ“Œ **Explication** :  
- `pool PUBLIC_POOL` â†’ Utilise le pool dÃ©fini pour l'adressage.  
- `overload` â†’ Active le **PAT** pour permettre le partage des IP avec des ports diffÃ©rents.

---

## ğŸ“Œ **5. VÃ©rification et DÃ©pannage du PAT**
### **ğŸ”¹ VÃ©rifier les traductions NAT actives**
```bash
R1# show ip nat translations
```
ğŸ“Œ Affiche les traductions NAT en cours, y compris les ports utilisÃ©s.

### **ğŸ”¹ VÃ©rifier les statistiques NAT**
```bash
R1# show ip nat statistics
```
ğŸ“Œ Montre le nombre de traductions NAT en cours et le type de NAT utilisÃ©.

### **ğŸ”¹ VÃ©rifier la configuration des interfaces**
```bash
R1# show running-config | include ip nat
```
ğŸ“Œ VÃ©rifie si les interfaces **inside/outside** et les rÃ¨gles NAT sont bien configurÃ©es.

---

## âœ… **RÃ©sumÃ© des Commandes Importantes**
| **Commande** | **Description** |
|--------------|-----------------|
| `access-list 1 permit 192.168.1.0 0.0.0.255` | DÃ©finit les adresses internes Ã  NATer |
| `ip nat inside source list 1 interface GigabitEthernet0/1 overload` | Active le PAT avec une seule IP publique |
| `ip nat pool PUBLIC_POOL <IP_start> <IP_end> netmask <masque>` | DÃ©finit un pool d'IP publiques |
| `ip nat inside source list 1 pool PUBLIC_POOL overload` | Configure le PAT avec un pool d'adresses IP publiques |
| `show ip nat translations` | VÃ©rifie les traductions NAT en cours |
| `show ip nat statistics` | Affiche les statistiques du NAT |

---

## ğŸ¯ **Conclusion**
- Le **PAT** est une solution efficace pour permettre Ã  **plusieurs hÃ´tes internes** d'accÃ©der Ã  Internet avec une seule **adresse IP publique**.
- Il fonctionne en attribuant un **port unique** Ã  chaque session pour diffÃ©rencier les connexions.
- Le **PAT avec pool** est utilisÃ© lorsqu'on dispose de **plusieurs IP publiques**.