# ğŸ”¹ **Configuration des Listes de ContrÃ´le dâ€™AccÃ¨s (ACL) sur un routeur Cisco**  

## ğŸ“Œ **1. Introduction aux ACL**  
Les **ACL (Access Control Lists)** sont utilisÃ©es sur les routeurs Cisco pour filtrer le trafic rÃ©seau en fonction dâ€™adresses IP, de protocoles, de ports, etc. Elles permettent de :
âœ… **Restreindre lâ€™accÃ¨s** aux ressources rÃ©seau  
âœ… **AmÃ©liorer la sÃ©curitÃ©** en limitant certains types de trafic  
âœ… **Optimiser la gestion du trafic**  

Il existe **deux types** dâ€™ACL sur Cisco :  
- **ACL standard** (filtre uniquement sur les adresses IP source)  
- **ACL Ã©tendue** (filtre sur lâ€™IP source/destination, protocole, port, etc.)  

---

## ğŸ“Œ **2. ACL Standard**
**Les ACL standards filtrent uniquement sur lâ€™adresse IP source.**  

### **ğŸ”¹ Exemple de topologie**
Un rÃ©seau avec **trois sous-rÃ©seaux** :  
- **192.168.1.0/24** (rÃ©seau interne)  
- **192.168.2.0/24** (rÃ©seau invitÃ©)  
- **192.168.3.0/24** (rÃ©seau administratif)  

On veut **bloquer lâ€™accÃ¨s du rÃ©seau invitÃ© (192.168.2.0/24) au rÃ©seau administratif (192.168.3.0/24)**.

### **ğŸ”¹ Ã‰tape 1 : Configurer une ACL Standard**
```bash
R1(config)# access-list 10 deny 192.168.2.0 0.0.0.255
R1(config)# access-list 10 permit any
```
ğŸ“Œ **Explication** :
- `access-list 10 deny 192.168.2.0 0.0.0.255` â†’ Bloque tout le trafic du rÃ©seau 192.168.2.0  
- `access-list 10 permit any` â†’ Autorise tout le reste du trafic  

---

### **ğŸ”¹ Ã‰tape 2 : Appliquer lâ€™ACL sur une Interface**
On applique cette ACL sur **lâ€™interface connectÃ©e au rÃ©seau administratif** en entrÃ©e :
```bash
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip access-group 10 in
R1(config-if)# exit
```
ğŸ“Œ **Explication** :
- `ip access-group 10 in` â†’ Applique lâ€™ACL 10 sur le trafic **entrant**  

---

## ğŸ“Œ **3. ACL Ã‰tendue**
**Les ACL Ã©tendues filtrent sur les adresses IP source/destination, protocole et ports.**  

### **ğŸ”¹ Objectif**  
Bloquer **les connexions HTTP (port 80)** venant du rÃ©seau invitÃ© **192.168.2.0/24** vers le serveur Web **192.168.3.10**.

### **ğŸ”¹ Ã‰tape 1 : Configurer une ACL Ã‰tendue**
```bash
R1(config)# access-list 100 deny tcp 192.168.2.0 0.0.0.255 host 192.168.3.10 eq 80
R1(config)# access-list 100 permit ip any any
```
ğŸ“Œ **Explication** :
- `deny tcp 192.168.2.0 0.0.0.255 host 192.168.3.10 eq 80` â†’ Bloque HTTP (port 80) du rÃ©seau invitÃ© vers le serveur  
- `permit ip any any` â†’ Autorise tout le reste du trafic  

---

### **ğŸ”¹ Ã‰tape 2 : Appliquer lâ€™ACL sur lâ€™Interface**
Appliquer sur lâ€™interface connectÃ©e au rÃ©seau invitÃ© **en sortie** :
```bash
R1(config)# interface GigabitEthernet0/2
R1(config-if)# ip access-group 100 out
R1(config-if)# exit
```
ğŸ“Œ **Explication** :
- `ip access-group 100 out` â†’ Applique lâ€™ACL 100 sur le trafic **sortant**  

---

## ğŸ“Œ **4. ACL avec NumÃ©rotation Nominale**
Au lieu dâ€™utiliser des numÃ©ros (`10`, `100`), on peut nommer les ACL.

### **ğŸ”¹ Exemple : Bloquer le ping (ICMP) vers le rÃ©seau 192.168.3.0**
```bash
R1(config)# ip access-list extended BLOCK_PING
R1(config-ext-nacl)# deny icmp any 192.168.3.0 0.0.0.255
R1(config-ext-nacl)# permit ip any any
R1(config-ext-nacl)# exit
```
Appliquer sur lâ€™interface connectÃ©e au rÃ©seau invitÃ© :
```bash
R1(config)# interface GigabitEthernet0/2
R1(config-if)# ip access-group BLOCK_PING in
```

---

## ğŸ“Œ **5. VÃ©rification et DÃ©pannage**
### **ğŸ”¹ Afficher les ACL configurÃ©es**
```bash
R1# show access-lists
```

### **ğŸ”¹ VÃ©rifier les ACL appliquÃ©es sur une interface**
```bash
R1# show ip interface GigabitEthernet0/1
```

### **ğŸ”¹ DÃ©sactiver une ACL dâ€™une interface**
```bash
R1(config)# interface GigabitEthernet0/1
R1(config-if)# no ip access-group 10 in
```

### **ğŸ”¹ Supprimer une ACL**
```bash
R1(config)# no access-list 10
```

---

## âœ… **RÃ©sumÃ© des Commandes Importantes**
| **Commande** | **Description** |
|--------------|-----------------|
| `access-list <numÃ©ro> permit/deny <protocole> <source> <masque> <destination> <port>` | CrÃ©e une ACL standard ou Ã©tendue |
| `ip access-group <numÃ©ro/nom> in/out` | Applique une ACL sur une interface |
| `ip access-list extended <nom>` | CrÃ©e une ACL nommÃ©e |
| `show access-lists` | Affiche les ACL configurÃ©es |
| `show ip interface <interface>` | VÃ©rifie les ACL appliquÃ©es |
| `no access-list <numÃ©ro>` | Supprime une ACL |

---

## ğŸ¯ **Conclusion**
- **ACL standard** : Filtre uniquement **sur lâ€™IP source**  
- **ACL Ã©tendue** : Filtre **IP source/destination, protocole et ports**  
- **Appliquer les ACL au bon endroit** (trafic entrant ou sortant)  
- **Toujours inclure `permit ip any any` Ã  la fin** pour Ã©viter un blocage total  
