**commandes de base** pour la **configuration d‚Äôun switch et d‚Äôun routeur Cisco** en ligne de commande (CLI), utiles dans un contexte d‚Äôapprentissage, de laboratoire ou d‚Äôadministration r√©seau :

---

### üîå 1. Configuration d‚Äôun **Switch Cisco**

#### ‚û§ Acc√®s au switch
```bash
Switch> enable
Switch# configure terminal
```

#### ‚û§ Renommer le switch
```bash
Switch(config)# hostname Switch1
```

#### ‚û§ D√©sactiver la recherche DNS (√©vite les lenteurs si commande erron√©e)
```bash
Switch1(config)# no ip domain-lookup
```

#### ‚û§ Configuration d‚Äôun mot de passe pour l‚Äôacc√®s en mode privil√©gi√©
```bash
Switch1(config)# enable secret Cisco123
```

#### ‚û§ Configuration de la ligne console
```bash
Switch1(config)# line console 0
Switch1(config-line)# password cisco
Switch1(config-line)# login
Switch1(config-line)# exit
```

#### ‚û§ Configuration de la ligne VTY (acc√®s SSH/Telnet)
```bash
Switch1(config)# line vty 0 4
Switch1(config-line)# password cisco
Switch1(config-line)# login
Switch1(config-line)# exit
```

#### ‚û§ Configuration d‚Äôune adresse IP sur une interface VLAN
```bash
Switch1(config)# interface vlan 1
Switch1(config-if)# ip address 192.168.1.2 255.255.255.0
Switch1(config-if)# no shutdown
Switch1(config-if)# exit
```

#### ‚û§ D√©finir la passerelle par d√©faut
```bash
Switch1(config)# ip default-gateway 192.168.1.1
```

#### ‚û§ Enregistrer la configuration
```bash
Switch1# write memory
# ou
Switch1# copy running-config startup-config
```

---

### üåê 2. Configuration d‚Äôun **Routeur Cisco**

#### ‚û§ Acc√®s au routeur
```bash
Router> enable
Router# configure terminal
```

#### ‚û§ Renommer le routeur
```bash
Router(config)# hostname R1
```

#### ‚û§ Configuration de l‚Äôinterface (exemple : GigabitEthernet 0/0)
```bash
R1(config)# interface gigabitEthernet 0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit
```

#### ‚û§ Configuration d‚Äôune autre interface (ex : r√©seau WAN)
```bash
R1(config)# interface gigabitEthernet 0/1
R1(config-if)# ip address 10.0.0.1 255.255.255.252
R1(config-if)# no shutdown
R1(config-if)# exit
```

#### ‚û§ Ajouter une route statique
```bash
R1(config)# ip route 192.168.2.0 255.255.255.0 10.0.0.2
```

#### ‚û§ Configuration de NAT/PAT (selon contexte)
```bash
# Exemple simplifi√©
R1(config)# ip nat inside source list 1 interface gigabitEthernet 0/1 overload
R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255
R1(config)# interface gigabitEthernet 0/0
R1(config-if)# ip nat inside
R1(config-if)# exit
R1(config)# interface gigabitEthernet 0/1
R1(config-if)# ip nat outside
```

#### ‚û§ Enregistrer la configuration
```bash
R1# write memory
# ou
R1# copy running-config startup-config
```

---

### üõ†Ô∏è Astuce
Pour **v√©rifier** les configurations :
```bash
# Voir les interfaces
show ip interface brief

# Voir la configuration en cours
show running-config

# Voir la table de routage
show ip route
```
