# ğŸ”¹ **Configuration du NAT (Network Address Translation) sur un routeur Cisco**  

## ğŸ“Œ **1. Introduction au NAT**  
Le **NAT (Network Address Translation)** est un processus qui permet de traduire les adresses IP privÃ©es d'un rÃ©seau interne vers une adresse IP publique pour l'accÃ¨s Ã  Internet. Ce processus est couramment utilisÃ© pour :
- **Permettre Ã  plusieurs hÃ´tes** d'utiliser une seule adresse IP publique (NAT de type **overloading** ou PAT)
- **AmÃ©liorer la sÃ©curitÃ©** en masquant les adresses internes
- **Simplifier la gestion des adresses IP publiques**

Les types de NAT incluent :
1. **Static NAT** : Une adresse IP privÃ©e est mappÃ©e Ã  une adresse IP publique.
2. **Dynamic NAT** : Une adresse IP privÃ©e est mappÃ©e Ã  une adresse IP publique disponible dans un pool.
3. **PAT (Port Address Translation)** : Plusieurs adresses IP privÃ©es peuvent partager une seule adresse IP publique avec des ports diffÃ©rents.

---

## ğŸ“Œ **2. Configuration du Static NAT**  
Le **Static NAT** permet de traduire une adresse IP privÃ©e spÃ©cifique vers une adresse IP publique spÃ©cifique.

### **ğŸ”¹ Exemple de topologie**
- **192.168.1.10** (hÃ´te interne)
- **200.200.200.10** (adresse IP publique)

### **ğŸ”¹ Ã‰tape 1 : Configurer le Static NAT**
```bash
R1(config)# ip nat inside source static 192.168.1.10 200.200.200.10
```
ğŸ“Œ **Explication** : Cette commande configure le **Static NAT**, mappant l'adresse privÃ©e **192.168.1.10** Ã  l'adresse publique **200.200.200.10**.

### **ğŸ”¹ Ã‰tape 2 : DÃ©finir les Interfaces**
Ensuite, il faut dÃ©finir les interfaces internes et externes sur le routeur.

```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip nat inside  # Interface interne
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip nat outside  # Interface externe
R1(config-if)# exit
```

---

## ğŸ“Œ **3. Configuration du Dynamic NAT avec un Pool dâ€™IP**  
Le **Dynamic NAT** attribue une adresse IP publique dynamique Ã  partir d'un pool d'adresses IP disponibles.

### **ğŸ”¹ Exemple de topologie**
- RÃ©seau interne : **192.168.1.0/24**
- Pool dâ€™adresses IP publiques : **200.200.200.10 - 200.200.200.20**

### **ğŸ”¹ Ã‰tape 1 : CrÃ©er un Pool dâ€™IP Publics**
```bash
R1(config)# ip nat pool PUBLIC_POOL 200.200.200.10 200.200.200.20 netmask 255.255.255.0
```
ğŸ“Œ **Explication** : CrÃ©e un pool dâ€™adresses IP publiques allant de **200.200.200.10** Ã  **200.200.200.20**.

### **ğŸ”¹ Ã‰tape 2 : Configurer un Access List pour le NAT**
L'ACL dÃ©finit quelles adresses privÃ©es peuvent Ãªtre traduites par NAT.

```bash
R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```
ğŸ“Œ **Explication** : Cette ACL permet aux adresses IP du rÃ©seau **192.168.1.0/24** d'Ãªtre traduites par NAT.

### **ğŸ”¹ Ã‰tape 3 : Appliquer le Dynamic NAT**
```bash
R1(config)# ip nat inside source list 1 pool PUBLIC_POOL
```
ğŸ“Œ **Explication** : Applique l'ACL (liste 1) et le pool d'adresses IP publiques pour effectuer la traduction d'adresses IP dynamiques.

### **ğŸ”¹ Ã‰tape 4 : DÃ©finir les Interfaces**
DÃ©finir l'interface interne et externe :

```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip nat inside
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip nat outside
R1(config-if)# exit
```

---

## ğŸ“Œ **4. Configuration du PAT (Port Address Translation)**  
Le **PAT** permet de traduire plusieurs adresses IP privÃ©es vers une seule adresse IP publique, en utilisant des numÃ©ros de port diffÃ©rents pour chaque session.

### **ğŸ”¹ Exemple de topologie**
- **RÃ©seau interne** : **192.168.1.0/24**
- **Adresse IP publique** : **200.200.200.10**

### **ğŸ”¹ Ã‰tape 1 : Configurer le PAT**
```bash
R1(config)# ip nat inside source list 1 interface GigabitEthernet0/1 overload
```
ğŸ“Œ **Explication** :  
- `source list 1` â†’ Utilise lâ€™ACL 1 pour le NAT.  
- `interface GigabitEthernet0/1` â†’ Utilise l'adresse IP de l'interface externe (200.200.200.10).  
- `overload` â†’ Permet d'utiliser une seule adresse IP publique pour plusieurs hÃ´tes internes en distinguant les sessions par les numÃ©ros de port.

### **ğŸ”¹ Ã‰tape 2 : DÃ©finir les Interfaces**
DÃ©finir l'interface interne et externe :

```bash
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip nat inside
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip nat outside
R1(config-if)# exit
```

---

## ğŸ“Œ **5. VÃ©rification et DÃ©pannage du NAT**  
### **ğŸ”¹ VÃ©rifier le NAT**
Pour vÃ©rifier l'Ã©tat du NAT, utilise la commande suivante :
```bash
R1# show ip nat translations
```
Cela affiche les traductions dâ€™adresses IP en cours.

### **ğŸ”¹ VÃ©rifier les interfaces NAT**
```bash
R1# show ip nat statistics
```
Cela montre les statistiques de NAT, y compris le nombre de traductions effectuÃ©es.

---

## âœ… **RÃ©sumÃ© des Commandes Importantes**
| **Commande** | **Description** |
|--------------|-----------------|
| `ip nat inside source static <ip_privee> <ip_publique>` | Configure un NAT statique |
| `ip nat pool <nom_pool> <ip_debut> <ip_fin> netmask <masque>` | CrÃ©e un pool d'adresses IP publiques pour le NAT dynamique |
| `ip nat inside source list <num_acl> pool <nom_pool>` | Applique le NAT dynamique avec un pool d'adresses IP |
| `ip nat inside source list <num_acl> interface <interface> overload` | Configure le PAT avec l'interface externe et l'option de surcharge |
| `show ip nat translations` | Affiche les traductions NAT en cours |
| `show ip nat statistics` | Affiche les statistiques NAT |

---

## ğŸ¯ **Conclusion**
- Le **Static NAT** associe une adresse IP privÃ©e Ã  une adresse IP publique de maniÃ¨re **fixe**.
- Le **Dynamic NAT** utilise un **pool d'adresses** publiques pour traduire les adresses privÃ©es.
- Le **PAT** permet Ã  **plusieurs hÃ´tes internes** de partager une seule adresse IP publique.