La configuration d'un serveur **DHCP** sur un routeur **Cisco** permet d'attribuer automatiquement des adresses IP aux clients du rÃ©seau. Voici les Ã©tapes gÃ©nÃ©rales pour configurer un serveur **DHCP** sur un routeur **Cisco**.

---

### ğŸ“Œ **1. AccÃ©der au mode de configuration**
Tout d'abord, connectez-vous au routeur via **console, SSH ou Telnet**, puis passez en mode de configuration globale :

```bash
 Router>enable
 Router#configure terminal
```

---

### ğŸ“Œ **2. CrÃ©er un pool DHCP**
Un pool DHCP dÃ©finit une plage d'adresses IP Ã  attribuer aux clients :

```bash
 Router(config)#ip dhcp pool NOM_DU_POOL
 Router(dhcp-config)#network 192.168.1.0 255.255.255.0  # Plage d'adresses IP
 Router(dhcp-config)#default-router 192.168.1.1         # Passerelle par dÃ©faut
 Router(dhcp-config)#dns-server 8.8.8.8 8.8.4.4         # Serveurs DNS
 Router(dhcp-config)#lease 7                            # DurÃ©e du bail en jours (ici, 7 jours)
```

---

### ğŸ“Œ **3. Exclure certaines adresses IP**
Si certaines adresses doivent Ãªtre **rÃ©servÃ©es** (pour des serveurs, imprimantes, etc.), on peut les exclure du pool :

```bash
 Router(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.10
```
Ici, les adresses **192.168.1.1 Ã  192.168.1.10** ne seront **pas attribuÃ©es** par le DHCP.

---

### ğŸ“Œ **4. Activer le service DHCP**
Le service DHCP est activÃ© par dÃ©faut, mais au cas oÃ¹ il serait dÃ©sactivÃ©, utilisez la commande :

```bash
 Router(dhcp-config)#service dhcp
```

---

### ğŸ“Œ **5. VÃ©rification et dÃ©pannage**
Pour vÃ©rifier que le DHCP fonctionne correctement :

âœ… **Afficher les baux DHCP attribuÃ©s :**
```bash
 Router#show ip dhcp binding
```

âœ… **Afficher l'Ã©tat du serveur DHCP :**
```bash
 Router#show ip dhcp server statistics
```

âœ… **VÃ©rifier les logs en cas de problÃ¨me :**
```bash
 Router#debug ip dhcp server events
```

---

### ğŸ“Œ **6. Sauvegarder la configuration**
Une fois la configuration terminÃ©e et testÃ©e, enregistrez-la pour Ã©viter de la perdre aprÃ¨s un redÃ©marrage :

```bash
 Router#write memory
```
ou
```bash
 Router#copy running-config startup-config
```

---

### ğŸ”¥ **Exemple Complet**
Si vous voulez un exemple concret, voici une configuration prÃªte Ã  l'emploi :

```bash
 Router>enable
 Router(config)#configure terminal

 Router(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.10
 Router(config)#ip dhcp pool LAN_POOL
 Router(dhcp-config)#network 192.168.1.0 255.255.255.0
 Router(dhcp-config)#default-router 192.168.1.1
 Router(dhcp-config)#dns-server 8.8.8.8 8.8.4.4
 Router(dhcp-config)#lease 7

 Router(dhcp-config)#service dhcp

 Router(config)#exit
 Router(config)#write memory
```

---

### ğŸ¯ **Conclusion**
Cette configuration permet Ã  un routeur **Cisco** de distribuer dynamiquement des adresses IP aux clients du rÃ©seau. Assurez-vous que l'interface qui connecte les clients est bien activÃ©e avec **`ip address`** et que les clients sont bien configurÃ©s en **DHCP**.

Si tu as des questions ou un scÃ©nario spÃ©cifique en tÃªte, fais-moi signe ! ğŸš€